Repository: BloomBooks/BloomDesktop
Catalog: DistFiles/localization/Bloom.sw.tmx
Source language: sw
Languages: en

source: Tatizo la Bloom
en: Bloom Problem

source: Ripoti Tatizo
en: Report Problem

source: Kuna uwezekana kuwa hii ni seti ya kitambo ya Bloom iliyotengenezwa kabla ya Seti ya Bloom kuwa na uwezo wa kushughulikia herufi za kipekee katika majina ya faili.Unaweza kupata mwandishi ili apate kukiandaa upya kwa kutumia tafsiri ya kisasa. Iwapo hii haiwezekani mtaalamu wa kiufundi anaweza kukarabati vitu.
en: Possibly this is an old Bloom Pack created before Bloom Packs could handle special characters in file names. You may be able to get the author to re-create it using a current version. If that's not possible a technical expert may be able to repair things.

source: Kuweka Seti ya Bloom
en: Bloom Pack Installation

source: Mkusanyiko sasa uko tayari kutumika kwenye kompyuta hii {0}.
en: The {0} Collection is now ready to use on this computer.

source: Kifaa cha kuweka Seti ya Bloom
en: Bloom Pack Installer

source: Seti hii ya Bloom inaonekana kutokamilika au kuharibika.
en: This BloomPack appears to be incomplete or corrupt.

source: {0} haipo
en: {0} does not exist

source: Bloom haikuweza kuweka Seti hiyo ya Bloom.
en: Bloom was not able to install that Bloom Pack

source: Kutoa...
en: Extracting...

source: Bloom tayari inaendelea, lakini yaliyomo hayatajitokeza hadi wakati huo mwingine utakapofungua Bloom
en: Bloom is already running, but the contents will not show up until the next time you run Bloom

source: Mkusanyiko wa Bloom hautaweza kuweka.
en: The Bloom collection will not be installed.

source: Kufungua {0}...
en: Opening {0}...

source: Kompyuta hii tayari ina mkusanyiko wa Bloom kwa jina '{0}'. Je, unataka kuubadilisha kwa huu mwingine ulio kwenye Seti hii ya Bloom?
en: This computer already has a Bloom collection named '{0}'. Do you want to replace it with the one from this Bloom Pack?

source: Seti za Bloom zinapaswa kuwa na folda moja tu ya mkusanyiko kwenye ngazi ya juu ya .ZIP faili.
en: Bloom Packs should have only a single collection folder at the top level of the .ZIP file.

source: Bloom haikuweza kutoa nakala iliyopo ya '{0}'. Funga Bloom iwapo imefunguliwa na ujaribu tena. Vinginevyo, jaribu tena baada ya kufungua kompyuta yako upya.
en: Bloom was not able to remove the existing copy of '{0}'. Quit Bloom if it is running & try again. Otherwise, try again after restarting your computer.

source: Ili kuchagua, tumia gurudumu la mausi yako au uelekeze unachokitaka, kisha uachilie kii.
en: To select, use your mouse wheel or point at what you want, then release the key.

source: Aina hii ya muundo kwa kawaida hutumika kwa visanduku vyote vya maandishi viliyo na mtindo '{0}'.
en: This formatting is the default for all text boxes with '{0}' style.

source: Badilisha ukubwa wa maandishi kwa visanduku vyote vilivyo na mtindo wa '{0}' na lugha '{1}'.\nUkubwa uliopo sasa ni pt {2}.
en: Changes the text size for all boxes carrying the style '{0}' and language '{1}'.\nCurrent size is {2}pt.

source: Aina hii ya muundo inatumika kwa visanduku vyote vya matini vilivyo na mtindo wa '{0}'.
en: This formatting is for all text boxes with '{0}' style.

source: Aina hii ya muundo hutumika kwa {0} visanduku vyote vya maandishi vilivyo na mtindo wa '{1}'.
en: This formatting is for all {0} text boxes with '{1}' style.

source: Samahani, Vigezo vya msomaji haviruhusu mabadiliko kwa muundo.
en: Sorry, Reader Templates do not allow changes to formatting.

source: Inaonekana kwamba baadhi ya sehemu za njia ya folda kufikia kitabu hiki zimetolewa au kupewa jina upya. Hivyo, Bloom haiwezi kuhifadhi mabadiliko yako ya ukurasa huu, na itahitaji kujifunga sasa. Iwapo hujakuwa ukivipa vitu majina upya au kuvisongesha, tafadhali bofya Maelezo yaliyo hapa chini na uripoti tatizo hili kwa wataalamu husika.
en: It appears that some part of the folder path to this book has been moved or renamed. As a result, Bloom cannot save your changes to this page, and will need to exit now. If you haven't been renaming or moving things, please click Details below and report the problem to the developers.

source: Nakili Habari ya kinachosababisha Tatizo
en: Copy Troubleshooting Information

source: Fungua ukurasa kwenye Mtandao (ambao ni lazima uwe kwenye hali inayoweza kubadilika ya NJIA).
en: Open Page in Firefox (which must be in the PATH environment variable).

source: Mpangilio wa hali ya Juu wa Programu
en: Advanced Program Settings

source: Fanya Bloom kujitengeneza upya
en: Automatically update Bloom

source: Onyesha Maagizo ya Kimajaribio (kama vile XML ya nje ya Mtindo wa Ndani)
en: Show Experimental Commands (e.g. Export XML for InDesign)

source: Onyesha Vigezo vya Kimajaribio (kama vile kamusi ya picha.)
en: Show Experimental Templates (e.g. Picture Dictionary)

source: (Kimajaribio) Onyesha Tuma/Pokea Udhibiti
en: (Experimental) Show Send/Receive Controls

source: Tumia chanzo cha picha ili kupunguza matumizi ya nafasi kwa picha kubwa.
en: Use Image Server to reduce memory usage with large images.

source: Bloom inabadilisha fonti ya kawaida ya "{0}" kuwa mpya ya "Andika Mpya ya Kimsingi".
en: Bloom is switching the default font for "{0}" to the new "Andika New Basic".

source: Hii itaboresha matokeo ya machapisho ya lugha nyingi. Iwapo lugha yako ni mojawapo ya chache zinazohitaji "Andika", unaweza kuirudisha tena kwenye mpangilio:Kutengeneza Kitabu.
en: This will improve the printed output for most languages. If your language is one of the few that need "Andika", you can switch it back in Settings:Book Making.

source: Kutengeneza Kitabu
en: Book Making

source: Fonti ya Kawaida kwa {0}
en: Default Font for {0}

source: Seti ya Machapisho ya Mbele/Nyuma
en: Front/Back Matter Pack

source: Kihifadhi Karatasi
en: Paper Saver

source: Desturi
en: Traditional

source: Mfumo wa Kulia hadi Kushoto wa Kuandika
en: Right to Left Writing System

source: Mipangilio ya Kipekee ya Hati
en: Special Script Settings

source: Mipangilio
en: Settings

source: Badilisha...
en: Change...

source: Lugha ya 1
en: Language 1

source: Lugha ya 2
en: Language 2

source: Lugha ya 3
en: Language 3

source: Lugha
en: Languages

source: Toa
en: Remove

source: Weka...
en: Set...

source: Lugha ya Mama
en: Vernacular Language

source: Lugha ya 2 (e.g. Lugha ya Kitaifa)
en: Language 2 (e.g. National Language)

source: Lugha yangu 3 (kama vile lugha ya eneo) (Sio lazima)
en: Language 3 (e.g. Regional Language) (Optional)

source: Jina la Mkusanyiko wa Bloom
en: Bloom Collection Name

source: Nchi
en: Country

source: Wilaya
en: District

source: Habari kuhusu Mradi
en: Project Information

source: Mkoa
en: Province

source: Anzisha upya
en: Restart

source: Bloom itafunga na kufungua tena mradi huu kwa mpangilio mpya.
en: Bloom will close and re-open this project with the new settings.

source: Tengeneza Seti ya Bloom ya Kigezo cha Msomaji...
en: Make Reader Template Bloom Pack...

source: Utawala wa mfumo wako hudhibiti utengenezaji upya wa kompyuta hii.
en: Your system administrator manages Bloom updates for this computer.

source: Ya hali ya juu
en: Advanced

source: Kutumia utengenezaji upya
en: Applying updates

source: Pata vitabu vingi zaidi vya vyanzo kwenye BloomLibrary.org
en: Get more source books at BloomLibrary.org

source: Mkusanyiko wa vyanzo
en: Source Collection

source: Nakili Kitabu
en: Copy Book

source: Futa Kitabu
en: Delete Book

source: Bloom sasa itafungua nyaraka hii HTML kwenye programu yako ya kutengeneza maneno(kwa kawaida neno au Ofisi ya Libre). Utaweza kufanya kazi kwa maandishi na picha za kitabu hiki. Programu hizi kwa kawaida sio nzuri kwa kuhifadhi mtindo, hivyo usitarajie mengi.
en: Bloom will now open this HTML document in your word processing program (normally Word or LibreOffice). You will be able to work with the text and images of this book. These programs normally don't do well with preserving the layout, so don't expect much.

source: Peleka kwenye neno au Ofisi ya Libre...
en: Export to Word or LibreOffice...

source: Peleka kwa XML kwa mtindo wa ndani...
en: Export to XML for InDesign...

source: Tengeneza upya Kitabu
en: Update Book

source: Tengeneza upya ukucha wa dole gumba
en: Update Thumbnail

source: Vyanzo Vya Vitabu Vipya
en: Sources For New Books

source: Mkusanyiko huu umefungwa, kwa hivyo vitabu vipya haviwezi kuongezwa/kutolewa.
en: This collection is locked, so new books cannot be added/removed.

source: Vitabu kutoka kwenye BloomLibrary.org
en: Books From BloomLibrary.org

source: Tengeneza Upya Vitabu Vyote
en: Do Updates of All Books

source: Angalia kwa Makini Vitabu Vyote
en: Do Checks of All Books

source: Rudisha Picha Zinazokosekana...
en: Rescue Missing Images...

source: Historia ya Mkusanyiko...
en: Collection History...

source: Maelezo ya Mkusanyiko...
en: Collection Notes...

source: Mikusanyiko
en: Collections

source: Kujenga...
en: Building...

source: Kitabu '{0}'
en: The book '{0}'

source: Fungua Folda kwenye Diski
en: Open Folder on Disk

source: Hariri kitabu hiki
en: Edit this book

source: Afya
en: Health

source: Kwa kuwa huu ni mkusanyiko wa chanzo, Broom haipeani sheli zozote zingine kama vyanzo vya sheli mpya. Iwapo unataka kuongeza lugha kwa sheli, badala yake unapaswa kuhariri mkusanyiko ulio na sheli, badala ya kutengeneza nakala yake. Pia, Kalenda ya Ukuta kwa sasa haiwezi kutumika kutengeneza Sheli mpya.
en: Because this is a source collection, Bloom isn't offering any existing shells as sources for new shells. If you want to add a language to a shell, instead you need to edit the collection containing the shell, rather than making a copy of it. Also, the Wall Calendar currently can't be used to make a new Shell.

source: Tengeneza seti ya Bloom
en: Make Bloom Pack

source: Tengeneza kitabu kwa kutumia chanzo hiki.
en: Make a book using this source.

source: Tengeneza kitabu kwa lugha yangu kwa kutumia kitabu hiki kama chanzo.
en: Create a book in my language using this source book.

source: Zaidi...
en: More...

source: Mkusanyiko Mwingine
en: Other Collection

source: Fungua/Tengeneza/Pata mkusanyiko
en: Open/Create/Get Collection

source: Fungua au Utengeneze Mkusanyiko Mwingine
en: Open or Create Another Collection

source: Sampuli za Sheli
en: Sample Shells

source: Tuma/Pokea
en: Send/Receive

source: Mkusanyiko wa Vyanzo
en: Source Collection

source: Fungua Folda nyingine ya Mikusanyiko
en: Open Additional Collections Folder

source: Vyanzo Vya Sheli Mpya
en: Sources For New Shells

source: Vielelezo
en: Templates

source: Mada iliyokosekana
en: Title Missing

source: Hauwezi kuunganishwa kwa mtandao ili kupata utengenezaji upya. Umejiunganisha na intaneti?
en: Could not connect to the server to check for an update. Are you connected to the internet?

source: Bloom yako iko katika hali ya kisasa.
en: Your Bloom is up to date.

source: Bloom hufanya kazi kila wakati kwa kuchunguza utengenezaji upya.
en: Bloom is already working on checking for updates.

source: Tafsiri mpya inaonekana kupatikana, lakini Bloom isiingeweza kuiweka.
en: A new version appears to be available, but Bloom could not install it.

source: Utengenezaji upya wa {0} uko tayari.
en: Update for {0} is ready.

source: Fanya maboresho upya Sasa
en: Update Now

source: Tafsiri mpya ya Bloom inapatikana.
en: A new version of Bloom is available.

source: Kuchukua maboresho na kuweka kwa {0} ({1}kb).
en: Downloading update to {0} ({1}kb).

source: Nyuma
en: Back

source: Batilisha
en: Cancel

source: U&batilishe
en: &Cancel

source: U&malize
en: &Finish

source: Usaidizi
en: Help

source: &Usaidie
en: &Help

source: Inashughulikia...
en: Loading...

source: &Inayofuata
en: &Next

source: Inayofuata
en: Next

source: SAWA
en: OK

source: &SAWA
en: &OK

source: Hiyari
en: optional

source: Upakuaji wako mtandaoni ({0}) umekamilika. Unaweza kuliona katika 'Vitabu kutoka kwenye kitengo cha Mkusanyiko wako cha BloomLibrary.org'.
en: Your download ({0}) is complete. You can see it in the 'Books from BloomLibrary.org' section of your Collections.

source: Upakuaji mtandaoni umekamilika
en: Download complete

source: Bloom ilitoa kitabu lakini ilipata matatizo katika kukifanya kuonekana kwenye Bloom. Tafadhali fungua kompyuta yako upya na ujaribu tena. Iwapo utapata ujumbe huu tena, tafadhali bofya kwenye kitufe cha 'Maelezo' na uripoti tatizo hili kwa wataalamu husika wa Bloom.
en: Bloom downloaded the book but had problems making it available in Bloom. Please restart your computer and try again. If you get this message again, please click the 'Details' button and report the problem to the Bloom developers.

source: Kupakua kitabu mtandaoni
en: Downloading book

source: Kulikuwa na tatizo katika upakuaji wa kitabu chako.
en: There was a problem downloading your book.

source: Kulikuwa na tatizo katika upakuaji kitabu chako.Unaweza kuhitajika kufungua upya Bloom au kupata usaidizii wa kiufudi.
en: There was a problem downloading your book. You may need to restart Bloom or get technical help.

source: Kulikuwa na tatizo wakati wa kupakua kitabu hiki: kitu fulani kilitumia muda mrefu sana. Unaweza kujaribu tena wakati mwingine, au utuandikie kwa issues@BloomLibrary.org iwapo huwezi kupata toleo la kitabu ili kufanya kazi kutoka mahali ulipo.
en: There was a problem downloading the book: something took too long. You can try again at a different time, or write to us at issues@BloomLibrary.org if you cannot get the download to work from your location.

source: Ongeza Ukurasa
en: Add Page

source: Ongeza Ukurasa Huu
en: Add This Page

source: Tumia Muundo huu
en: Use This Layout

source: Endelea hata hivyo
en: Continue anyway

source: Chagua muundo Tofauti...
en: Choose Different Layout...

source: Kubadilisha hadi kuwa katika muundo huu kutafanya baadhi ya yaliyohumu kupotea.
en: Converting to this layout will cause some content to be lost.

source: Ongeza Ukurasa...
en: Add Page...

source: Iwapo unahitaji mahali pa kuandika habari zaidi kuhusu kitabu, unaweza kutumia ukurasa huu, ambao ndio wa ndani wa jalada la nyuma.
en: If you need somewhere to put more information about the book, you can use this page, which is the inside of the back cover.

source: Iwapo unahitaji mahali pa kuandika habari zaidi kuhusu kitabu, unaweza kutumia ukurasa huu ambao ndio wa nje wa jalada la nyuma.
en: If you need somewhere to put more information about the book, you can use this page, which is the outside of the back cover.

source: Usuli
en: Background

source: Lugha mbili
en: Two Languages

source: Fungua iliyotumika kutengeneza hima , kwenye mtandao (lazima iwe kwenye njia)
en: Open the HTML used to make this PDF, in Firefox (must be on path)

source: Samahani, haki ya kunakili na leseni ya kitabu hiki haiwezi kubadilishwa.
en: Sorry, the copyright and license for this book cannot be changed.

source: Samahani, kitabu hiki kimefungiwa ili picha zisiweze kubadilishwa.
en: Sorry, this book is locked down so that images cannot be changed.

source: Chagua Muundo Tofauti
en: Choose Different Layout

source: Hakika Ukurasa Ufutwe?
en: Really Delete Page?

source: U&fute
en: &Delete

source: Ukurasa huu utatolewa na hauwezi kurejeshwa tena.
en: This page will be permanently removed.

source: Mipangilio ya Lugha nyingi
en: Multilingual Settings

source: Chagua lugha ili kufanya hiki kuwa kitabu cha lugha mbili au lugha tatu
en: Choose language to make this a bilingual or trilingual book

source: Nakili
en: Copy

source: Nakili (Ctrl+C)
en: Copy (Ctrl+C)

source: Unapaswa kuchagua baadhi ya maandishi kabla ya kuinakili
en: You need to select some text before you can copy it

source: Nakili habari hii kwenye picha zote katika kitabu hiki?
en: Copy this information to all other pictures in this book?

source: Badilisha Muundo
en: Change Layout

source: au
en: or

source: Picha
en: Picture

source: Maandishi
en: Text

source: Kisanduku cha maandishi
en: Text Box

source: Kata
en: Cut

source: Kata (Ctrl+X)
en: Cut (Ctrl+X)

source: Unapaswa kuchagua baadhi ya maandishi kabla ya kuyakata
en: You need to select some text before you can cut it

# Toa Ukurasa
source: Toa \n Ukurasa
en: Remove\n Page

source: Toa ukurasa huu kwenye kitabu
en: Remove this page from the book

source: Ukurasa huu hauwezi kutolewa
en: This page cannot be removed

# Fanya kurasa kuwa mbili
source: Fanya kurasa\n kuwa mbili
en: Duplicate\n Page

source: Ingiza ukurasa mpya ambao ni nakala ya huu
en: Insert a new page which is a duplicate of this one

source: Ukurasa huu hauwezi kunakiliwa
en: This page cannot be duplicated

source: Hakiki
en: Edit

source: Hauwezi kubadilisha hii kwa kuwa hii siyo nakala ya kwanza.
en: You cannot change these because this is not the original copy.

source: Neno Linaloonekana
en: Sight Word

source: Neno ili haliwezi kufasiriwa katika ukurasa huu.
en: This word is not decodable in this stage.

source: Sentensi ni ndefu sana kwa hatua hii.
en: This sentence is too long for this level.

source: Mkazo
en: Emphasis

source: Ukurasa huu ni sampuli ya awali ya majaribio ambayo inaweza kuwa na matatizo mengi, ambapo tunaomba radhi.
en: This page is an experimental prototype which may have many problems, for which we apologize.

source: Fonti
en: Font

source: Fonti iliyochaguliwa kwa sasa ni '', lakini haijawekwa kwenye kompyuta hii.Fonti nyingine itatumiwa.
en: The current selected font is '{0}', but it is not installed on this computer. Some other font will be used.

source: Badilisha ukubwa wa maandishi kwa visanduku vyote vilivyo na mtindo wa '{0}' na lugha '{1}'.\nUkubwa uliopo kwa sasa ni pt {2}.
en: Changes the text size for all boxes carrying the style '{0}' and language '{1}'.\nCurrent size is {2}pt.

source: Mtindo huo tayari uko. Tafadhali chagua jina lingine
en: That style already exists. Please choose another name.

source: Badilisha mpaka na usuli
en: Change the border and background

source: Herufi
en: Characters

source: Tengeneza
en: Create

source: Tengeneza mtindo mpya
en: Create a new style

source: Je, huoni unachohitaji?
en: Don't see what you need?

source: Badilisha fonti
en: Change the font face

source: Badilisha ukubwa wa fonti
en: Change the font size

source: mpangilio
en: Format

source: Badilisha nafasi kati ya mistari ya maandishi
en: Change the spacing between lines of text

source: Zaidi
en: More

source: Mtindo mpya
en: New style

source: Tafadhali tumia tu herufi za kialfabeti. Nambari zilizo mwisho ziko sawa, kama zilivyo kwenye "sehemu ya2".
en: Please use only alphabetical characters. Numbers at the end are ok, as in "part2".

source: Mtindo
en: Style

source: Jina la Mtindo
en: Style Name

source: Pana Kupita Kiasi
en: Extra Wide

source: Kawaida
en: Normal

source: Badilisha nafasi kati ya maneno
en: Change the spacing between words

source: Pana
en: Wide

source: Badilisha muundo kwa mtindo
en: Adjust formatting for style

source: Unaweza kutumia nafasi hii kwa mwandishi/mchoraji, au chochote kile.
en: You may use this space for author/illustrator, or anything else.

source: Unapotengeneza kitabu cha kwanza, tumia kisanduku hiki ili kurekodi mchango uliopeanwa na waandishi, wachoraji, wahakiki, na kadhalika.
en: When you are making an original book, use this box to record contributions made by writers, illustrators, editors, etc.

source: Unapotengeneza kitabu kutoka kwa sheli, tumia kitabu hiki kusema aliyetafsri.
en: When you make a book from a shell, use this box to tell who did the translation.

source: Jina la Kitabu {lang}
en: Book title in {lang}

source: Bofya kwenye Kuhakiki Haki ya Kunakili na Leseni.
en: Click to Edit Copyright and License

source: Tumia hii kutambua maajenti wote waliopeana usaidizi wa kifedha.
en: Use this to acknowledge any funding agencies.

source: Nambari ya Wastani ya Kitabu ya Kimataifa. Acha wazi iwapo huna mojawapo ya hizi.
en: International Standard Book Number. Leave blank if you don't have one of these.

source: Iwapo unahitaji mahali pa kuandika habari zaidi kuhusu kitabu, unaweza kutumia ukurasa huu, ambao ni wa upande wa ndani wa jalada la mbele.
en: If you need somewhere to put more information about the book, you can use this page, which is the inside of the front cover.

source: Jina la mtafsiri, aliyepo {lang}
en: Name of Translator, in {lang}

source: Ya kwanza au utambulizi wa (Sheli) katika {lang}
en: Original (or Shell) Acknowledgments in {lang}

source: Mchango uliotolewa na waandishi, wafundishi, wahakiki, na kadhalika katika {lang}
en: The contributions made by writers, illustrators, editors, etc., in {lang}

source: Bofya ili kuchagua mada
en: Click to choose topic

source: Utambulizi wa tafsiri, katika {lang}
en: Acknowledgments for translated version, in {lang}

source: Ili kufungua kitabu hiki cha sheli, nenda kwenye kijisanduku cha vifaa katika upande wa kulia, tafuta ikoni ya gia, na ukliki 'Kubali mabadiliko kwa kitabu hiki cha sheli'.
en: To unlock this shellbook, go into the toolbox on the right, find the gear icon, and click 'Allow changes to this shellbook'.

source: Badilisha Picha
en: Change Image

source: Nakili Picha
en: Copy Image

source: Kata Picha
en: Cut Image

source: Hariri Sifa za Picha, Haki ya kunakili, na Leseni
en: Edit Image Credits, Copyright, and License

source: Weka Picha
en: Paste Image

source: Batilisha ubebaji huu
en: Cancel this import

source: Tumia JPEG Jalada
en: Use the JPEG file

source: Faili uliyochagua ni faili JPEG. JPEG faili huwa bora zaidi kwa picha na kazi ya sanaa ya rangi. Hata hivyo, JPEG faili huwa tatizo kuu kwa sanaa ya mistari mieusi na mieupe. Matatizo yanajumuisha:\n Siobainika na vitone vya rangi ya kijivuu.\n Faili kubwa, na kuifanya vigumu kusambaza kitabu.\n Iwapo kuna vingi vikubwa JPEG, Bloom huenda isiwe na nafasi ya kutosha ili kutengeneza PDF faili.\n\nKumbuka: Kwa sababu JPEG ni hasara, kubadilisha JPEG kuwa PNG, TIFF, BMP kwa kweli huharibu mambo zaidi. Iwapo hii ni sanaa ya mstari mweusi na mweupe, unataka kupata skani kwa mojawapo ya miundo hiyo.\n\nTafadhali chagua mojawapo ya yafuatayo, kisha bofya SAWA:
en: The file youve chosen is a JPEG file. JPEG files are perfect for photographs and color artwork. However, JPEG files are a big problem for black and white line art. Problems include:\n Fuzziness and grey dots.\n Large file sizes, making the book hard to share.\n If there are many large JPEGs, Bloom may not have enough memory to make PDF files.\n\nNote: Because JPEG is lossy, converting a JPEG to PNG, TIFF, or BMP actually makes things even worse. If this is black and white line art, you want to get an original scan in one of those formats.\n\nPlease select from one of the following, then click OK:

source: JPEG Onyo
en: JPEG Warning

source: Chaguo hili linapatikana tu kwenye nembo ya Kuchapisha.
en: This option is only available in the Publish tab.

source: Lugha moja
en: One Language

source: Kitabu
en: Book

source: Kabla ya kuweka picha, nakili moja kwa 'klipbodi', kutoka kwa programu nyingine.
en: Before you can paste an image, copy one onto your 'clipboard', from another program.

source: Hakuna chaguo lingine la miundo kwa kigezo hiki.
en: There are no other layout options for this template.

source: Kisanduku hiki kina maandishi mengi zaidi kuliko yatakayotoshea
en: This box has more text than will fit

source: Kifaa kwenye ukurasa huu kimejaa kupita kiasi
en: A container on this page is overflowing

source: Mabadiliko hayo hayakubaliwi. Machapisho ya upande wa mbele na machapisho ya upande wa nyuma yanapaswa kusalia pale yalipo.
en: That change is not allowed. Front matter and back matter pages must remain where they are.

source: Hatua Isiyofaa
en: Invalid Move

source: Kurasa
en: Pages

source: Chagua ukubwa wa ukurasa na maelekezo
en: Choose a page size and orientation

source: Weka baada ya kunakili
en: Paste

source: Weka baada ya kunakili(Ctrl+V)
en: Paste (Ctrl+V)
